{"id":292,"date":"2022-09-12T11:51:39","date_gmt":"2022-09-12T06:21:39","guid":{"rendered":"https:\/\/pap.clickcodemedia.com\/?page_id=292"},"modified":"2022-10-11T14:11:44","modified_gmt":"2022-10-11T08:41:44","slug":"part-policy","status":"publish","type":"page","link":"https:\/\/www.preferautoparts.com\/part-policy\/","title":{"rendered":"Parts Policy"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-page\" data-elementor-id=\"292\" class=\"elementor elementor-292\">\n\t\t\t\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-a240d43 elementor-section-height-min-height elementor-section-boxed elementor-section-height-default elementor-section-items-middle\" data-id=\"a240d43\" data-element_type=\"section\" data-settings=\"{&quot;background_background&quot;:&quot;classic&quot;}\">\n\t\t\t\t\t\t\t<div class=\"elementor-background-overlay\"><\/div>\n\t\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-a4c6808\" data-id=\"a4c6808\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-element elementor-element-d21bce5 elementor-widget elementor-widget-heading\" data-id=\"d21bce5\" data-element_type=\"widget\" data-widget_type=\"heading.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<style>\/*! elementor - v3.9.2 - 21-12-2022 *\/\n.elementor-heading-title{padding:0;margin:0;line-height:1}.elementor-widget-heading .elementor-heading-title[class*=elementor-size-]>a{color:inherit;font-size:inherit;line-height:inherit}.elementor-widget-heading .elementor-heading-title.elementor-size-small{font-size:15px}.elementor-widget-heading .elementor-heading-title.elementor-size-medium{font-size:19px}.elementor-widget-heading .elementor-heading-title.elementor-size-large{font-size:29px}.elementor-widget-heading .elementor-heading-title.elementor-size-xl{font-size:39px}.elementor-widget-heading .elementor-heading-title.elementor-size-xxl{font-size:59px}<\/style><h2 class=\"elementor-heading-title elementor-size-default\">Part Policy\n<\/h2>\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-263f3fb elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"263f3fb\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-bd09cde\" data-id=\"bd09cde\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-element elementor-element-8c5d657 elementor-widget elementor-widget-text-editor\" data-id=\"8c5d657\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<style>\/*! elementor - v3.9.2 - 21-12-2022 *\/\n.elementor-widget-text-editor.elementor-drop-cap-view-stacked .elementor-drop-cap{background-color:#818a91;color:#fff}.elementor-widget-text-editor.elementor-drop-cap-view-framed .elementor-drop-cap{color:#818a91;border:3px solid;background-color:transparent}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap{margin-top:8px}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap-letter{width:1em;height:1em}.elementor-widget-text-editor .elementor-drop-cap{float:left;text-align:center;line-height:1;font-size:50px}.elementor-widget-text-editor .elementor-drop-cap-letter{display:inline-block}<\/style>\t\t\t\t<p><strong>PART POLICY<\/strong><\/p><p>Prefer Auto Parts (PAP) gives you access to the largest inventory of used and recycled auto parts such as Engines, Transmission, Transfer Case, Control Module, Drive Shaft etc. available for all auto makes and models including luxury auto brands. All the parts are sold after the pictures are approved from the customer. Every part is sold without the hardware. There must be special request for the hardware. The hinges are however not under warranty.<\/p><p>Warranty is activated from the day the customer orders the part. <strong>Warranty on all Engines, Transmissions, and Parts is 30 days from the date of the actual date of purchase.<\/strong><\/p><p><br \/><strong>A\/C Condenser<\/strong><\/p><p>The condenser fan and the clutch is sold together, however, we do not warranty on the clutch.<br \/> <\/p><p><strong>ABS:<\/strong><\/p><p>ABS assembly is sold complete with module , power brake booster , ABS Pump and the Master cylinder. The wiring hareness doesnt come with the ABS as being a heavy wear and tear part.<\/p><p><br \/><strong>Air Filter:<\/strong><\/p><p>Sold as the housing only.<br \/>Airbags:<\/p><p>Airbags are sold AS IS as being hazardous material.<\/p><p><br \/><strong>Airbox\/Air cleaner:<\/strong><\/p><p>The box is sold without the filter inside. Sold as housing only.<br \/>Antenna:<\/p><p>Antennas are sold as a unit. However, the mounting is not included in it.<\/p><p><br \/><strong>Axle Assembly:<\/strong><\/p><p>The unit is sold from hub to hub. We do not guarantee on any kind of bushing, bearings and sensors. There is no warranty on the backing plates as they are sold separate. If the Assembly does not shift gears or has a leak, agrade replaces the unit on the whole.<\/p><p><br \/><strong>Axle Beam:<\/strong><\/p><p>This unit is sold with the correct measurement. Should there be any mismatch in the length due to some modification from the customer; Agrade has the rights to hold 25% Restocking fees for returns.<\/p><p><br \/><strong>Axle Shaft:<\/strong><\/p><p>This unit is sold without bearings and bushings. If they come with these, they are not under warranty.<\/p><p><strong>Back Glass:<\/strong><\/p><p>This is termed fragile and is sold to the neighboring states only.<\/p><p><strong>Bell Housing:<\/strong><\/p><p>This unit is sold with an exact specification and description of the vehicle. If the bell housing is along with the transmission, we do not guarantee.<br \/>Blocks:<\/p><p>Long or Short blocks are sold to rebuildable units only.<\/p><p><strong>Body Parts:<\/strong><\/p><p>All the body parts are sold after the pictures are approved from the customer. Every body part is sold without the hardware. There must be special request for the hardware. The hinges are however not under warranty. There must be special request placed for inner panels, Fender flares, eyebrows, hardware, color match (but not shades).<\/p><p><br \/><strong>CD Player\/Radio:<\/strong><\/p><p>The unit is sold without the wiring harness. Cylinder Head: Cylinder heads are sold without being bent or out of shape\/warped. The rings and valves may have to be re-machined.<\/p><p><strong>Differential:<\/strong><\/p><p>The unit is sold with the exact gear ratio and its only the chunk.<\/p><p><strong>Door panels:<\/strong><\/p><p>Door panels are sold as a bare panel. No switches or moldings come with it.<\/p><p><strong>Doors:<\/strong><\/p><p>Doors are sold as shells only. The panel, regulator, and the railings are sold separately. A special request can be made for special doors for high-end vehicles. However, we will not match the interiors of the vehicle when an inner door panel is included. Side view mirrors are not included with the door, they are sold separately.<\/p><p><strong>Drive Shaft<\/strong><\/p><p>The Drive shaft is sold without the rubber bushes, if they come with it, we do not warranty on the same.<\/p><p><strong>Electrical Parts:<\/strong><\/p><p>Any computers or modules are confirmed to have the correct part#. Any electrical item has a onetime replacement warranty only. These modules and computers may need to be reset from the dealer or an ASC certified mechanic in case of defect. If there is no result of the defect with a print copy, the modules cannot be accepted for a return, or there will be a 25% Restocking fees.<\/p><p><strong>Engine:<\/strong><\/p><p>Engines are complete assemblies with manifolds. Timing cover, belts, oil pan, fuel injectors, gaskets, hoses and other accessories are not included in the warranty. The warranty is only on the long block. The replaceable parts are the water pump, spark plugs, and wires. ARP is not responsible for these parts due to the high wear and tear in nature.<\/p><p><strong>Exhaust Manifold:<\/strong><\/p><p>The manifold is sold only if it integrate with a catalytic convertor.<\/p><p><strong>Frames:<\/strong><\/p><p>Frames are sold AS IS without any warranty. we ask customers to send us a cut sheet explaining where he wants us the frames to be cut from. Its sold AS-IS because once the frame is removed and cut, it cannot be re-stocked in case its returned. If the customer has questions reg the condition of the frame, he can always request pictures before shipping. Once shipped, there is no return.<\/p><p><strong>Fuel Pump:<\/strong><\/p><p>The fuel pumps are sold as the whole unit.<\/p><p><strong>Fuel Tank:<\/strong><\/p><p>Fuel tanks are sold as-is without the fuel pump or sending unit. There won’t be any cracks or damages to the tank.<\/p><p><strong>Grille:<\/strong><\/p><p>The part is sold based on the car that wants the grille. There is no emblem guaranteed with it.<\/p><p><strong>Header panel:<\/strong><\/p><p>The header panel is sold as a bare header panel, the lights, fog lamps, and turn signals do not go with it. However, ordering a complete header panel will cost extra based on the car. Please be advised that the grille does not come with the header panel. The grille is sold separately.<\/p><p><strong>Headlights:<\/strong><\/p><p>The headlights are sold without the bulbs and Agrade is not responsible for the damaged bezel as it is not under warranty. However, if the customer orders an HID, we give the complete headlight with the bulbs, ballast, module, and the igniter. It goes as a complete assembly.<\/p><p><strong>Heater controls:<\/strong><\/p><p>The unit is sold with a perfect match of a customer’s picture. Should there be no markings on the buttons, the part will not be returned for a refund unless its deemed defective.<\/p><p><strong>Ignition Switch:<\/strong><\/p><p>This unit is sold without the wiring harness. There is no key attached to the ignition switch. Instrument Cluster: The clusters are sold based on the specification of a car. There is no warranty on the miles that is recorded on the cluster. Certain vehicles need reprogramming.<\/p><p><strong>Oil Pan:<\/strong><\/p><p>The oil pan is sold on the customer’s request. There shall be specification shared for the correct oil pan.<\/p><p><strong>Quarter Panel:<\/strong><\/p><p>This part needs to be ready with an exact cut sheet measurement. The customer is to be sure of the measurement that is needed to be cut in order for us to ship the unit.<\/p><p><strong>Rack and Pinion:<\/strong><\/p><p>This unit is not sold with the bottom gear box. The gear box is sold separately.<\/p><p><strong>Radiator fan:<\/strong><\/p><p>The fan is sold as a separate unit and does not go with the radiator. The motor for the fan needs to be bough separate. However, the motor is not covered under warranty if it is defective.<\/p><p><strong>Radiators:<\/strong><\/p><p>The radiators will have some sort of condition based on the age of the vehicle. We cannot be sure of the lines in the front if they are honeycomb or straight lines unless they are of a perfect fit for the vehicle.<\/p><p><strong>Rear view Mirror:<\/strong><\/p><p>These are basic mirrors only, we do not sell rearview with open and close garage doors or gates.<\/p><p><strong>Roof:<\/strong><\/p><p>The assembly is sold as a standard roof. Please be advised, that the sunroof and the motor and the glass do not come with the assembly, these are sold separate. However, a customer can place a special request.<\/p><p><strong>Seats:<\/strong><\/p><p>Seats are sold AS IS, without warranty or Guarantee.We send pictures for approval before shipping, Once shipped there is no return. If there is a problem with the seat mechanism like the seat track, then we can send the mechanism separately. But there is no return on seats.<\/p><p><strong>Side View Mirrors:<\/strong><\/p><p>The side-view mirrors are sold with the match for the car. Please note, we do not match the shade of the color of the vehicle. The customers are requested to paint it according to the shade of the car color.<\/p><p><strong>Spindle:<\/strong><\/p><p>The spindle is sold as only the spindle; there are knuckles that go separate. Please be careful about what you are ordering.<br \/>Spoiler front and rear:<\/p><p>The spoiler in the front is sold without any hardware and the rear spoiler is sold without the lights or the reflectors.<\/p><p><strong>Stabilizer bar:<\/strong><\/p><p>The unit is sold with the correct measurements. The measurement needs to be matched.<\/p><p><strong>Steering column:<\/strong><\/p><p>The unit is sold without the wheel, should the wheels go along with the columns, there is no warranty on the wheel. We do not cover the intermediate shaft and the rings. The column comes with the Keys.<\/p><p><strong>Steering knuckle:<\/strong><\/p><p>This unit tends to have surface rust.<\/p><p><strong>Steering Pumps:<\/strong><\/p><p>The pumps are confirmed to function when installed. However, we do not warranty on the hoses or sensors.<\/p><p><strong>Strut:<\/strong><\/p><p>The unit is sold as-is with the spring.<\/p><p><strong>Sunroof Motor:<\/strong><\/p><p>The motor is sold without the railing. If the motor is defective, we will gladly replace it.<\/p><p><strong>Tail Light:<\/strong><\/p><p>This item is sold with or without the bezel. Irrespective, the bezel is not under warranty.<\/p><p><strong>Tailgate\/Trunk lid:<\/strong><\/p><p>These units are sold without the lock mechanism or the hardware or hinges. The inner panel as subject to special requests.<\/p><p><strong>Torque convertor:<\/strong><\/p><p>The torque convertor is for auto transmission and does not include the flywheel which is for manual transmission.<\/p><p><strong>Transfer case:<\/strong><\/p><p>The case is sold as a complete unit. However, we do not warranty on the U joints or rubber joints. We make sure that the flange is not bent before sold. Some transfer cases come with sensors and we do not warranty on sensors.<\/p><p><strong>Transmission:<\/strong><\/p><p>The transmission is guaranteed to shift gears and bearings to be good. The oil pan and oil filter need to be replaced before installation. Flush out all the liquid and from test cooler lines. The torque convertor needs to be fully engaged to the front pump. For manual transmission, a new clutch needs to be installed along with the pressure plate and slave cylinder. The flywheel must be turned once before installation.<\/p><p><strong>Turn Signal:<\/strong><\/p><p>The unit is sold with or without the bulb as it is not under warranty. The turn signal does not come with the bezel or chrome trim.<\/p><p><strong>Wheels:<\/strong><\/p><p>The wheels are sold based on the specification. The wheels do not come with the wheel cover or cap. The wheels will have rust based on the age of the vehicle.<\/p><p><strong>Window motor and Regulator:<\/strong><\/p><p>The unit is sold separately. The regulator does not go with the motor and the motor does not go with the regulator.<\/p><p><strong>Window switch:<\/strong><\/p><p>The switch is sold as a whole unit. We do not sell for a specific command of the door.<\/p><p><strong>Windshield wiper motor:<\/strong><\/p><p>The motor is sold without the wiper arms. If it&#8217;s defective other than just the motor, we will be happy to replace it.<\/p><p><strong>Windshield wiper regulator:<\/strong><\/p><p>The regulator must function as mentioned other than the mechanism itself, we do not cover under this, At any given time for any part, we do not guarantee on rubber bushings, bearings, and high wear and tear in nature parts or labor costs.<\/p>\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>Part Policy PART POLICY Prefer Auto Parts (PAP) gives you access to the largest inventory of used and recycled auto parts such as Engines, Transmission, Transfer Case, Control Module, Drive Shaft etc. available for all auto makes and models including luxury auto brands. All the parts are sold after the pictures are approved from the &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.preferautoparts.com\/part-policy\/\"> <span class=\"screen-reader-text\">Parts Policy<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"site-sidebar-layout":"no-sidebar","site-content-layout":"page-builder","ast-global-header-display":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"disabled","ast-breadcrumbs-content":"","ast-featured-img":"disabled","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":""},"_links":{"self":[{"href":"https:\/\/www.preferautoparts.com\/wp-json\/wp\/v2\/pages\/292"}],"collection":[{"href":"https:\/\/www.preferautoparts.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.preferautoparts.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.preferautoparts.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.preferautoparts.com\/wp-json\/wp\/v2\/comments?post=292"}],"version-history":[{"count":7,"href":"https:\/\/www.preferautoparts.com\/wp-json\/wp\/v2\/pages\/292\/revisions"}],"predecessor-version":[{"id":330,"href":"https:\/\/www.preferautoparts.com\/wp-json\/wp\/v2\/pages\/292\/revisions\/330"}],"wp:attachment":[{"href":"https:\/\/www.preferautoparts.com\/wp-json\/wp\/v2\/media?parent=292"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}